In [6]:
import numpy as np
import pandas as pd

In [7]:
#2차원 리스트로 데이터 프레임 생성
df = pd.DataFrame([['a','b','c'],['a','a','g'],['a','a']])
df

   0  1     2
0  a  b     c
1  a  a     g
2  a  a  None

In [8]:
#열방향 인덱스(문자) 행방향 인덱스(숫자)가 있는 데이터 프레임 생성
#열 데이터를 dict 형태로 작성하는게 일반적
df1=pd.DataFrame({'A':[90,80,70],'B':[85,98,75],'C':[88,99,77],'D':[87,89,86]})
df1

    A   B   C   D
0  90  85  88  87
1  80  98  99  89
2  70  75  77  86

In [9]:
#딕셔너리로 데이터 프레임 생성
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982,0.0141]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2000002],
 '2005': [9762546, 3512547, 2517680, 2456016],
 '2000': [9853972, 3655437, 2466338, 2473990],
 '지역': ['수도권', '경상권', '수도권', '경상권'],
 '2010-2015 증가율': [0.0283, 0.0163, 0.0982, 0.0141]}

In [10]:
# 열방향 인덱스 columns=
columns =['지역','2015','2010','2005','2000','2010-2015 증가율']
# 행방향 인덱스 index=
index=['서울','부산','인천','대구']
# DataFrame(데이터, index=,columns=)
df2=pd.DataFrame(data,index=index,columns=columns)
df2

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

In [11]:
a=pd.Series([100,200,300],['a','b','d'])
b=pd.Series([101,201,301],['a','b','k'])
c=pd.Series([110,210,310],['a','b','c'])

pd.DataFrame([a,b,c], index=[100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

In [12]:
a=pd.Series([100, 200, 300], ['a','b','d'])
b=pd.Series([101, 201, 301], ['a','b','k'])
c=pd.Series([110, 210, 310], ['a','b','c'])

pd.DataFrame([a,b,c], index=[100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

In [13]:
trainData=pd.read_csv('./data/train.csv')
trainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
#열방향 인덱스 출력
df2.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [15]:
df2

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

In [16]:
df2.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [17]:
#시리즈처럼 dataFrame에서도 각 방향 인덱스에 name 속성을 지정할 수 있음
df2.index.name='도시'
df2.columns.name='특성'
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

In [19]:
#데이터만 접근하려면 values 속성을 사용
df2.values

#반환값은 array 형태

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2000002, 2456016, 2473990, 0.0141]], dtype=object)

In [20]:
#DataFrame의 개요 출력
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010-2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 224.0+ bytes

In [22]:
#DataFrame의 기술통계 출력 : 수치형 데이터에 대하여 
df2.describe()

특성             2015          2010          2005          2000  2010-2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.414178e+06  4.562197e+06  4.612434e+06       0.039225
std    3.507776e+06  3.524531e+06  3.500545e+06  3.538749e+06       0.039809
min    2.466052e+06  2.000002e+06  2.456016e+06  2.466338e+06       0.014100
25%    2.784351e+06  2.474027e+06  2.502264e+06  2.472077e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06       0.098200

In [23]:
#(행,열)의 개수 출력
df2.shape

(4, 6)

In [24]:
#df2 전치: .T속성 
dfT=df2.T
dfT
#원본데이터를 변경하지 않는다.

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2000002
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [25]:
#사용 예제
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

In [30]:
# 열 내용 변경: 증가율을 퍼센트값으로 변경
df2['2010-2015 증가율']=df2['2010-2015 증가율']/100
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2000002  2456016  2473990           1.41

In [33]:
#열추가
df2['2005-2015 증가율']=((df2['2015']-df2['2005'])/df2['2005']*100).round(2)

df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83           1.45
부산  경상권  3448737  3393191  3512547  3655437           1.63          -1.82
인천  수도권  2890451  2632035  2517680  2466338           9.82          14.81
대구  경상권  2466052  2000002  2456016  2473990           1.41           0.41

In [34]:
#열삭제, del df[삭제열]

del df2['2010-2015 증가율']
df2

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45
부산  경상권  3448737  3393191  3512547  3655437          -1.82
인천  수도권  2890451  2632035  2517680  2466338          14.81
대구  경상권  2466052  2000002  2456016  2473990           0.41

In [35]:
#인덱스로 라벨값 1개 사용
df2['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [36]:
#열 1개를 접근할때는 . 연산자 사용 가능 df.
df2.지역

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [37]:
#지역컬럼 데이터유형 확인
type(df2['지역'])
#pandas.core.series.series

pandas.core.series.Series

In [38]:
#열을 추출할때 df로 반환 받고자하면 []를 사용
#리스트로 인덱싱: df로 반환
#여러 개의 열을 추출

df2[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2000002  2466052

In [39]:
문자열은 숫자로 받을수없다. 키에러가 발생한다. 
df2[1]

KeyError: 1

In [ ]:
#위치적으로 맨처음 열을 반환받기 위해 위치 인덱스 사용
try:
    df2[0] #keyerror 발생
except Exception as e:
    print(type(e))

In [42]:
df3=pd.DataFrame(np.arange(12).reshape(3,4))
df3

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [43]:
#위치 인덱싱이 아닌 컬럼명이 숫자로 되어있는 df의 접근
df3[0]

0    0
1    4
2    8
Name: 0, dtype: int32

In [44]:
df3[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [45]:
#예제 데이터 프레임
df2

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45
부산  경상권  3448737  3393191  3512547  3655437          -1.82
인천  수도권  2890451  2632035  2517680  2466338          14.81
대구  경상권  2466052  2000002  2456016  2473990           0.41

In [46]:
#1행추출[:1]-슬라이싱 사용

df2[:1]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45

In [47]:
#1행 추출
df2[0:1]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45

In [48]:
#[시작값:끝값+1]
df2[1:3]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -1.82
인천  수도권  2890451  2632035  2517680  2466338          14.81

In [50]:
#행 인덱스 '서울'부터 '부산'까지 추출

df2['서울':'부산']

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45
부산  경상권  3448737  3393191  3512547  3655437          -1.82

In [51]:
df2['2015']['서울']

9904312

In [52]:
#원소값의 형태가 출력-정수
type(df2['2015']['서울'])

numpy.int64

In [ ]:
- 데이터프레임은 열기준으로 접근 원칙: [열이름]
- 행기준 접근을 위해서는 슬라이싱을 적용: [행이름:행이름]
- 행과 열을 같이 적용(개열요소) :[열이름][행이름]

In [54]:
df2['2015']['서울':'부산']

도시
서울    9904312
부산    3448737
Name: 2015, dtype: int64